Modules/Core/Repositories/AuthRepository.php

select `roles`.*, `role_users`.`user_id` as `pivot_user_id`, `role_users`.`role_id` as `pivot_role_id`, `role_users`.`created_at` as `pivot_created_at`, `role_users`.`updated_at` as `pivot_updated_at` from `roles` inner join `role_users` on `roles`.`id` = `role_users`.`role_id` where `role_users`.`user_id` = 1
---
    public function roleRedirect()
    {
        $user = $this->getUser();
        $role = $user->roles->first();