Modules/Core/Http/Controllers/PermissionController.php

select * from `tbl_modules` where `tbl_modules`.`id` in (1, 2)
---
    public function index(Request $request){
        $this->data = [
            'title'         => $this->title.' Manager',
            'pageUrl'       => $this->bUrl,
            'page_icon'     => '<i class="fas fa-tasks"></i>',
            'roles'         => Roles::get(),
            'modules'       =>  Module::where('status',1)->get(),
            'sections'      =>  $this->model::orderBy('module_id')->with('module')->get(),
        ];



        if($request->method() === 'POST' ){
            $rules = [
                'role_id'	=> ['required'],
            ];
            $validator = Validator::make($request->all(), $rules);
            if($validator->fails()) {
                return redirect()->back()->withErrors($validator)->withInput();
            }else{
                $role = $this->data['role_id'] = $request['role_id'];
                $section_id = $this->data['section_id'] = $request['section_id'];
                $module_id = $this->data['module_id'] = $request['module_id'];
                $permissions = $this->data['rolePermissions'] = $this->auth->findRoleById($role);
                $query = $this->model::orderBy('section_name');
                if ($section_id) {
                    $query->where('id', $section_id);
                }
                if ($module_id) {
                    $query->where('module_id', $module_id);
                    $this->data['sections'] = $this->model::orderBy('module_id')->where('module_id', $module_id)->with('module')->get();