Modules/Core/Http/Controllers/PermissionController.php

    public function index(Request $request){
        $this->data = [
            'title'         => $this->title.' Manager',
            'pageUrl'       => $this->bUrl,
            'page_icon'     => '<i class="fas fa-tasks"></i>',
            'roles'         => Roles::get(),
            'modules'       =>  Module::where('status',1)->get(),
            'sectionNames'  =>  [],
        ];
---
select * from `tbl_modules` where `status` = 1
select * from `roles`

    public function edit(Request $request){
        $this->data = [
            'title'         => $this->title.' Edit',
            'pageUrl'       => $this->bUrl.'/edit',
            'page_icon'     => '<i class="fas fa-edit"></i>',
            'modules'       =>  Module::where('status',1)->get(),
            'roles'         =>  Roles::get(),
            'section_id'    => $request['section_id'],
            'sections'      =>  [],
        ];
---
select * from `tbl_modules` where `status` = 1
select * from `roles`

            $data = [
                'm_permission' =>json_encode($m_permission),
            ];
            User::where('id', $user_id)->update($data);
---
update `users` set `permissions` = '{\"core.blood_group\":true}', `users`.`updated_at` = '2022-10-29 00:54:34' where `id` = 2