Modules/Core/Http/Controllers/SettingsController.php

    public function index(){

        $this->data = [
                'title'     => 'System Settings',
                'page_icon' => '<i class="fa fa-book"></i>',
                'pageUrl'   => $this->bUrl,
                'allData'   => $this->bUrl,
                'allTex'    => Tax::orderBy('tax_id', 'ASC')->get(),
---
select * from `tbl_tax` order by `tax_id` asc