Modules/Core/Http/Controllers/UserController.php

    public function index(Request $request){
        $this->data = [
            'title'         => $this->title.' Manager',
            'pageUrl'       => $this->bUrl,
            'page_icon'     => '<i class="fas fa-tasks"></i>',
            'objData'       => [],
        ];
        $role = $this->auth->getUser()->roles->first();

        $order_by = $role->order_by;
        $this->data['roles'] = Roles::where('order_by','>=',$order_by)->get();
---
select `roles`.*, `role_users`.`user_id` as `pivot_user_id`, `role_users`.`role_id` as `pivot_role_id`, `role_users`.`created_at` as `pivot_created_at`, `role_users`.`updated_at` as `pivot_updated_at` from `roles` inner join `role_users` on `roles`.`id` = `role_users`.`role_id` where `role_users`.`user_id` = 1
select * from `roles` where `order_by` >= 1

    public function profile(Request $request, $id){

        $objData    = $this->model::where('users.id', $id)
            ->leftJoin('role_users', 'users.id', 'role_users.user_id')
            ->leftJoin('roles', 'role_users.role_id', 'roles.id')
            ->selectRaw('users.*, roles.name, roles.id as role_id')->first();

        $id = filter_var($id, FILTER_VALIDATE_INT);
        if( !$id || empty($objData) ){ exit('Bad Request!'); }
        $this->data = [
            'title'         =>  $this->title.' Profile',
            'page_icon'     => '<i class="fa fa-book"></i>',
            'objData'       => $objData,
            'permission'    => $request['permission'],
            'pageUrl'       => $this->bUrl.'/'.$id,
        ];
        $this->data['modules']      = Module::orderBy('id')->with('sections')->where('status',1)->get();
---
select users.*, roles.name, roles.id as role_id from `users` left join `role_users` on `users`.`id` = `role_users`.`user_id` left join `roles` on `role_users`.`role_id` = `roles`.`id` where `users`.`id` = '2' limit 1
select * from `tbl_modules` where `status` = 1 order by `id` asc