Modules/Hrms/Http/Controllers/DepartmentController.php

select `roles`.*, `role_users`.`user_id` as `pivot_user_id`, `role_users`.`role_id` as `pivot_role_id`, `role_users`.`created_at` as `pivot_created_at`, `role_users`.`updated_at` as `pivot_updated_at` from `roles` inner join `role_users` on `roles`.`id` = `role_users`.`role_id` where `role_users`.`user_id` = 1
select * from `roles` where `order_by` >= 1 order by `order_by` asc
---
    public function index(Request $request){
        $this->data = [
            'title'         => $this->title.' Manager',
            'pageUrl'       => $this->bUrl,
            'page_icon'     => '<i class="fas fa-tasks"></i>',
            'objData'       => [],
            'filters'       => $this->model::$filters
        ];

        $this->data['add_title'] = 'Add New '.$this->title;

        $all_data = $this->crudServices->getIndexData($request, $this->model, 'order_by');

        if ($request->filled('filter')) {
            $this->data['filter'] = $filter = $request->get('filter');
        }
        $this->data['allData']  = $all_data['allData']; // paginate
        $this->data['serial']   = $all_data['serial'];

        $role                       = $this->auth->getUser()->roles->first();
        $order_by                   = $role->order_by;
        $this->data['roles']        = Roles::where('order_by','>=',$order_by)->orderBY('order_by')->get();

select `roles`.*, `role_users`.`user_id` as `pivot_user_id`, `role_users`.`role_id` as `pivot_role_id`, `role_users`.`created_at` as `pivot_created_at`, `role_users`.`updated_at` as `pivot_updated_at` from `roles` inner join `role_users` on `roles`.`id` = `role_users`.`role_id` where `role_users`.`user_id` = 1
select * from `roles` where `order_by` >= 1 order by `order_by` asc
---
    public function edit($id){

        $objData = $this->model::where($this->tableId, $id)->first();
        $id = filter_var($id, FILTER_VALIDATE_INT);
        if( !$id || empty($objData) ){ exit('Bad Request!'); }

        $this->data = [
            'title'         => 'Edit '.$this->title,
            'pageUrl'       => $this->bUrl,
            'page_icon'     => '<i class="fas fa-edit"></i>',
            'objData'       => $objData
        ];

        $role                       = $this->auth->getUser()->roles->first();
        $order_by                   = $role->order_by;
        $this->data['roles']        = Roles::where('order_by','>=',$order_by)->orderBY('order_by')->get();