Modules/Hrms/Http/Controllers/EmployeeController.php

    public function create(){

        $this->data = [
            'title'         => 'Add New '.$this->title,
            'pageUrl'       => $this->bUrl.'/create',
            'page_icon'     => '<i class="fas fa-plus"></i>',
            'objData'       => ''
        ];

        $this->data['genders']      = Gender::orderBy('order_by')->orderBy('id')->get();
        $this->data['religions']    = Religion::orderBy('order_by')->orderBy('id')->get();
        $this->data['blood_groups'] = BloodGroup::orderBy('order_by')->orderBy('id')->get();
        $this->data['departments']  = Department::orderBy('order_by')->orderBy('id')->get();
        $this->data['designation']  = Designation::orderBy('order_by')->orderBy('id')->get();
---
select * from `tbl_gender` order by `order_by` asc, `id` asc
select * from `tbl_religion` order by `order_by` asc, `id` asc
select * from `tbl_blood_groups` order by `order_by` asc, `id` asc
select * from `hrms_departments` order by `order_by` asc, `id` asc
select * from `hrms_designations` order by `order_by` asc, `id` asc

    public function edit($id){

        $objData = $this->model::where($this->tableId, $id)->first();
        $id = filter_var($id, FILTER_VALIDATE_INT);
        if( !$id || empty($objData) ){ exit('Bad Request!'); }

        $this->data = [
            'title'         => 'Edit '.$this->title,
            'pageUrl'       => $this->bUrl.'/'.$id,
            'page_icon'     => '<i class="fas fa-edit"></i>',
            'objData'       => $objData
        ];

        $this->data['genders']      = Gender::orderBy('order_by')->orderBy('id')->get();
        $this->data['religions']    = Religion::orderBy('order_by')->orderBy('id')->get();
        $this->data['blood_groups'] = BloodGroup::orderBy('order_by')->orderBy('id')->get();
        $this->data['departments']  = Department::orderBy('order_by')->orderBy('id')->get();
        $this->data['designation']  = Designation::orderBy('order_by')->orderBy('id')->get();
---
select * from `tbl_gender` order by `order_by` asc, `id` asc
select * from `tbl_religion` order by `order_by` asc, `id` asc
select * from `tbl_blood_groups` order by `order_by` asc, `id` asc
select * from `hrms_departments` order by `order_by` asc, `id` asc
select * from `hrms_designations` order by `order_by` asc, `id` asc

    public function store(Request $request){
        $id = $request[$this->tableId];
        $validator = $this->getValidation($request);
        if ($validator->fails()){
            return redirect()->back()->withErrors($validator)->withInput();
        }
        $params = $this->getInsertData($request);
        if (empty($id) ) {
            $employee_id = $this->model::create($params)->id;
---
insert into `hrms_employees` (`id_number`, `name`, `department_id`, `gender_id`, `religion_id`, `mobile`, `email`, `basic_salary`, `total_salary`, `blood_group_id`, `social_media`, `birth_date`, `joining_date`, `updated_at`, `created_at`) values ('123456', 'Rasel Hossain', '1', '1', '1', '01911', 'rasel@gmail.com', '40000', '40000', '1', '[{\"media_name\":\"facebook\",\"media_link\":null},{\"media_name\":\"facebook\",\"media_link\":null}]', '', '', '2022-11-04 01:56:53', '2022-11-04 01:56:53')

    public function createUser($request, $id){
        $department_id = $request['department_id'];
        $department = Department::where(['id'=>$department_id])->first();
        if (!empty($department)){
            if (!empty($department->role_id)){
                $user = User::where('employee_id', $id)->first();
---
select * from `hrms_departments` where (`id` = '1') limit 1
select * from `users` where `employee_id` = '5' limit 1